app/Http/Controllers/Auth/RegisteredUserController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('ganga', 'ganga@gmail.com', '$2y$12$mkashuNXfGgX5iVjPUQ4kuH/9NNEcnkXi5VQSftizAoRljwgqDgSu', '2025-03-01 15:07:30', '2025-03-01 15:07:30')
---
     public function store(Request $request) : RedirectResponse
     {
          $request->validate([
               'name'     => ['required', 'string', 'max:255'],
               'email'    => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
               'password' => ['required', 'confirmed', Rules\Password::defaults()],
          ]);

          $user = User::query()->create([
               'name'     => $request->name,
               'email'    => $request->email,
               'password' => Hash::make($request->password),
          ]);