app/Rules/LessonSlugBelongsToCourse.php

    public function validate(string $attribute, mixed $value, Closure $fail): void{
         if (!Lesson::query()->where('slug', $value)->where('course_id', $this->course->id)->exists()) {
---
select exists(select * from `lessons` where `slug` = 'test1' and `course_id` = 1 order by `order` asc) as `exists`