app/Http/Controllers/IndexController.php

select `course_id` from `courses` inner join `course_student` on `courses`.`id` = `course_student`.`course_id` where `course_student`.`user_id` = 3
---
     public function courses()
     {
          $courses = Course::query()->where('status', Status::ACTIVE->value)->withCount('students')->get();
          $myCourses = auth()->user()?->enrolledCourses->pluck('course_id')->toArray() ?? [];
          return view('front.courses')->with([
               'courses' => $courses,
               'myCourses' => $myCourses
          ]);

select * from `users` where `users`.`id` in (2)
select `id` from `courses` inner join `course_student` on `courses`.`id` = `course_student`.`course_id` where `course_student`.`user_id` = 3
---
     public function courseDetail(Course $course)
     {
          if($course->status !== Status::ACTIVE){
               abort(403);
          }
          $course->load(['instructor', 'lessons'])->loadCount('students');
          $isAlreadyEnrolled = auth()->user()?->enrolledCourses->contains($course->id);
          $isCreator = auth()->user()->createdCourses->contains($course->id);
          return view('front.course-detail')->with([
               'course' => $course,
               'isCreator' => $isCreator,
               'isAlreadyEnrolled' => $isAlreadyEnrolled
          ]);