app/Http/Controllers/PaymentController.php

select * from `courses` where `slug` = 'test' limit 1
---
    public function verifyPayment(Request $request)
    {
        $khaltiPaymentData = session()->pull('khalti_payment_init');
        $secretKey = config('services.khalti.secret_key');
        $endpoint = config('services.khalti.endpoint');
        if(empty($khaltiPaymentData)){
             return redirect()->route('front.home')->with(['toastr.error' => 'Invalid Action']);
        }
        $response = Http::withHeaders([
             'Authorization' => "key $secretKey",
            'Content-Type' => 'application/json',
        ])->post("$endpoint/epayment/lookup/", [
             'pidx' => $khaltiPaymentData['pidx'] ?? null,
        ]);
        $result = $response->json();
        if(empty($result['status']) || $result['status'] !== 'Completed'){
             return redirect()->route('front.home')->with(['toastr.error' => 'Something went wrong!']);
        }
        $courseSlug = $request->input("purchase_order_id");
        $course = Course::query()->where('slug', $courseSlug)->first();

select `id` from `courses` inner join `course_student` on `courses`.`id` = `course_student`.`course_id` where `course_student`.`user_id` = 3
---
     public function initiatePayment(Course $course)
     {
          $student = auth()->user();
          $secretKey = config('services.khalti.secret_key');
          $endpoint = config('services.khalti.endpoint');

          $isAlreadyEnrolled = in_array($course->id, auth()->user()->courses()->pluck('id')->toArray());