app/Http/Controllers/Dashboard/CourseController.php

select `courses`.`id`, `slug`, `thumbnail`, `title`, `price`, `courses`.`created_at`, `status`, `users`.`name` as `instructor_name` from `courses` inner join `users` on `courses`.`user_id` = `users`.`id` limit 5 offset 0
select count(*) as aggregate from `courses` inner join `users` on `courses`.`user_id` = `users`.`id`
---
     public function index()
     {
          $data['activeMenu'] = 'courses';
          $data['courses'] =  Course::query()->select('courses.id', 'slug','thumbnail', 'title', 'price', 'courses.created_at', 'status')->when(auth()->user()->role ===
               Role::TEACHER,
               function
          ($query){
               $query->where('user_id', auth()->user()->id);
          })->when(auth()->user()->role === Role::ADMIN, function($query){
               $query->join('users', 'courses.user_id', '=', 'users.id')
               ->addSelect('users.name as instructor_name');
          })->paginate(5);

update `courses` set `status` = 'active', `courses`.`updated_at` = '2025-02-28 16:54:41' where `id` = 1
---
     public function updateStatus(Course $course, Request $request)
     {
          $request->validate([
               'status' => [Rule::enum(Status::class)],
          ]);
          $course->update([
               'status' => $request->input('status'),
          ]);