app/Http/Controllers/Dashboard/LessonController.php

    public function store(Course $course, Request $request)
    {
        $validated = $request->validate([
             'title'       => ['required', 'string', 'max:255'],
             'description' => ['required', 'string'],
             'video'       => ['required', 'mimes:mp4,mov,avi,mkv,flv', 'max:50000'],
        ]);
         $maxOrder = Lesson::query()->where('course_id', $course->id)->max('order');
         $videoPath = $request->file('video')->store("courses/{$course->slug}/lessons", 'public');
         $ffProbe = FFProbe::create();
         $videoDuration = $ffProbe->format(public_path("storage/$videoPath"))->get('duration');
         Lesson::query()->create([
              'title'       => $validated['title'],
              'description' => $validated['description'],
              'course_id'   => $course->id,
              'order'       => $maxOrder + 1,
              'video_url'   => $videoPath,
              'duration'    => round($videoDuration),
        ]);
---
select max(`order`) as aggregate from `lessons` where `course_id` = 1
insert into `lessons` (`title`, `description`, `course_id`, `order`, `video_url`, `duration`, `slug`, `updated_at`, `created_at`) values ('test2', 'dsfjf', 1, 2, 'courses/test/lessons/9MmwDAlw6p1lokgQFv45GGtkdRc04OE0syuG8GKX.mov', 11, 'test2', '2025-02-28 16:53:37', '2025-02-28 16:53:37')

     public function reorder(Course $course, Request $request)
     {
          $request->validate([
               'sorted_lessons' => ['required', 'array'],
               'sorted_lessons.*' => [new LessonSlugBelongsToCourse($course)],
          ]);
          $sortedLessons = $request->input('sorted_lessons');
          DB::transaction(function () use ($sortedLessons) {
               foreach ($sortedLessons as $index => $slug) {
                    Lesson::query()->where('slug', $slug)->update(['order' => $index + 1]);
---
update `lessons` set `order` = 1, `lessons`.`updated_at` = '2025-03-01 15:40:22' where `slug` = 'test1' order by `order` asc