app/Http/Controllers/Dashboard/QuizController.php

select count(*) as aggregate from `quizzes`
---
     public function index()
     {
          $data['activeMenu'] = 'quiz';
          $data['quizzes'] = Quiz::query()->with('course')->paginate(5);