app/Http/Controllers/Dashboard/UserController.php

select `id`, `name`, `role`, `created_at` from `users` limit 10 offset 0
select count(*) as aggregate from `users`
---
     public function index()
     {
          $data['activeMenu'] = 'users';
          $data['users'] =  User::query()->select('id', 'name', 'role', 'created_at')->paginate(10);